---
kind: method
id: M:Autodesk.Revit.DB.DefaultOpenFromCloudCallback.#ctor
source: html/d56a8786-55f4-792c-e4e8-0d86f8e0ab77.htm
---
# Autodesk.Revit.DB.DefaultOpenFromCloudCallback.#ctor Method

Create a default open callback. Open latest by default for all scenarios.

## Syntax (C#)
```csharp
public DefaultOpenFromCloudCallback()
```